-- Створюємо один банкомат
INSERT INTO atm (id, maintenance_status, atmkey) VALUES (1, 'OPERATIONAL', 'ATM12345');

-- Додаємо сервісні послуги, які надає банкомат
INSERT INTO services (id, name, service_number, description, atm_id) VALUES
(1, 'Зняття готівки', 'SVC001', 'Дозволяє швидко сплатити наявні штрафи через банкомат, ввівши номер банку та суму переказу.', 1),
(2, 'Оплата мобільного', 'SVC002', 'Дозволяє швидко сплатити наявні штрафи через банкомат, ввівши номер банку та суму переказу.', 1),
(3, 'Оплата штрафів', 'SVC003', 'Дозволяє швидко сплатити наявні штрафи через банкомат, ввівши номер банку та суму переказу.', 1),
(4, 'Оплата комунальних послуг', 'SVC004', 'Дає змогу оплатити рахунки за електроенергію, газ, воду та інші комунальні послуги без відвідування каси.', 1),
(5, 'Оплата домашнього інтернету', 'SVC005', 'Дозволяє здійснити оплату за домашній інтернет, ввівши номер особового рахунку.', 1);

-- Додаємо купюри, доступні в банкоматі
INSERT INTO bills (id, denominations, amount, atm_id) VALUES
(1, 'TEN', 50, 1),
(2, 'TWENTY', 40, 1),
(3, 'FIFTY', 30, 1),
(4, 'HUNDRED', 20, 1);

-- Додаємо користувачів
INSERT INTO users (id, is_blocked, name, surname, card_number, card_date, cardcvv, cardpin, attempts, current_balance) VALUES
(1, false, 'Дмитро', 'Демчук', 4441114429266420, 1225, 123, '7H/kIWbgrkxWBZiue2f2+g==', 0, 1000.00),
(2, false, 'Олександр', 'Іванюк', 4441111400108986, 1126, 456, '6B/svhE9YYUBq1l+tcE+4g==', 0, 2000.00);
